#Испорченный телефон

#Ограничение времени	1 секунда
#Ограничение памяти	64Mb
#Ввод	стандартный ввод или input.txt
#Вывод	стандартный вывод или output.txt

#Теперь телефон немного испортился и передает
#введенные фразы в другом порядке: сначала третью, затем первую и только потом вторую.
#Переставьте фразы в правильном порядке.
#_________________________________________________
#Формат ввода
#Вводятся три строки в неправильном порядке.

#Формат вывода
#Вывести введённые строки в правильном порядке.

#__________________________________________________
#Пример

#Ввод

#И мне, и жене, и Тотоше.
#Мой милый, хороший,
#Пришли мне калоши,

#Вывод

#Мой милый, хороший,
#Пришли мне калоши,
# И мне, и жене, и Тотоше.

third = input()
first = input()
second = input()
print(first)
print(second)
print(third)